[
        {
            "title": "Booki",
            "cover": "../assets/Booki/desktop.png",
            "description": "Développement d'une page d'accueil responsive en HTML et CSS - Formation OpenClassrooms.",
            "difficulties": "Manipulation des grids selon les différentes tailles d'écran.",
            "solution" : "Ressources utiles fournies dans les cours.",
            "skills": [
                "HTML",
                "CSS"
            ],
            "link" : "https://booki-topaz.vercel.app/",
            "git" : "https://github.com/Camille0985/Booki"
        },
        {
            "title": "Kasa",
            "cover": "../assets/Kasa/card.png",
            "description": "Création d'une application React avec mise en place de React Router - Formation OpenClassrooms",
            "difficulties" : "Réalisation d'animations en CSS, gestion de la navigation entre les différentes routes.",
            "solution" : "Ressources utiles fournies dans les cours, mise en place de React Router DOM",
            "skills" : [
                "CSS",
                "React"
            ],
            "link" : "https://kasa-amber.vercel.app/",
            "git" : "https://github.com/Camille0985/Kasa"
        },
        {
            "title": "Sophie Bruel - Architecte",
            "cover": "../assets/Architecte/user_view.png",
            "description": "Création d'une page web dynamique avec Javascript",
            "difficulties" : "Gestion des appels à l'API avec fetch, connexion et authentification de l'utilisateur.",
            "solution" : "Utilisation des différentes méthodes POST, GET et DELETE et vérifications du succès des requêtes avec Postman.",
            "skills" : [
                "Javascript",
                "Postman"
            ],
            "link" : "",
            "git" : "https://github.com/Camille0985/Sophie-Bruel-Architecte"
        },
        {
            "title": "Mon Vieux Grimoire",
            "cover": "../assets/Mon_Vieux_Grimoire/user_view.png",
            "description": "Développement du back-end du site web, création d'un serveur Express et d'une API RESTful.",
            "difficulties" : "Mise en place d'un système d'authentification utilisateur et stockage des données dans une base de donnée. Téléchargement et optimisation des images entrantes en respect du Green Code",
            "solution" : "Utilisation de Jsonwebtoken et bcrypt pour sécuriser l'authentification et mot de passe utilisateur, sauvegarde des données avec MongoDB Atlas. Les images sont récupérées et optimisées avec Multer et Sharp.",
            "skills" : [
                "Javascript",
                "Node.js",
                "Express",
                "MongoDB"
            ],
            "link" : "",
            "git" : "https://github.com/Camille0985/Mon-Vieux-Grimoire"
        }
    ]
